<template>
  <NuxtLayout name="main" title="Активность" :nav="nav"></NuxtLayout>
</template>

<!-- ----------------------------------------------------- -->
<!-- ----------------------------------------------------- -->

<script lang="ts" setup>
/**
 * Переменные ----------------
 */
const route = useRoute();
const nav = [{ label: 'Активность', link: route.path }];
</script>

<!-- ----------------------------------------------------- -->
<!-- ----------------------------------------------------- -->

<style lang="scss" scoped></style>
